app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("project_name", "project_description", "project_avatar_file_name", "project_avatar_content_type", "project_avatar_file_size", "project_avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "project_avatar_file_name" = ?, "project_avatar_file_size" = ?, "project_avatar_updated_at" = ?, "updated_at" = ? WHERE "projects"."id" = ?